<a href="https://colab.research.google.com/github/Susmithapi/data-cleaning/blob/main/Untitled6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
data_set = pd.read_csv("/content/data_set.csv")

In [ ]:
print(data_set)

    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       India,In         1999       TRUE
1       1  66.0   $55k-$66k     3.5    New York,Ny         2002       TRUE
2       2   NaN   $77k-$89k    -1.0    New York,Ny           -1         -1
3       3  64.0   $44k-$99k     4.4       India In         1988         -1
4       4  25.0   $44k-$99k     6.4  Australia Aus         2002         -1
5       5  44.0   $77k-$89k     1.4       India,In         1999       TRUE
6       6  21.0   $44k-$99k     0.0    New York,Ny           -1         -1
7       7  44.0   $44k-$99k    -1.0  Australia Aus           -1         -1
8       8  35.0   $44k-$99k     5.4    New York,Ny           -1         -1
9       9  22.0   $44k-$99k     7.7       India,In           -1       TRUE
10     10  55.0   $10k-$49k     5.4       India,In         2008       TRUE
11     11  44.0   $10k-$49k     6.7       India,In         2009         -1
12     12   NaN   $44k-$99k     0.0       India,In         1999         -1
13     13  25.0   $44k-$99k    -1.0  Australia Aus         2019       TRUE
14     14  66.0   $44k-$99k     4.0  Australia Aus         2020       TRUE
15     15  44.0  $88k-$101k     3.0  Australia Aus         1999         -1
16     16  19.0   $19k-$40k     4.5       India,In         1984         -1
17     17   NaN   $44k-$99k     5.3    New York,Ny         1943       TRUE
18     18  35.0   $44k-$99k     6.7    New York,Ny         1954       TRUE
19     19  32.0   $44k-$99k     3.3    New York,Ny         1955       TRUE
20     20   NaN   $44k-$99k     5.7    New York,Ny         1944       TRUE
21     21  35.0   $44k-$99k     5.0    New York,Ny         1946         -1
22     22  19.0   $55k-$66k     7.8    New York,Ny         1988       TRUE
23     23   NaN   $44k-$99k     2.4    New York,Ny         1999       TRUE
24     24  13.0   $44k-$99k    -1.0    New York,Ny         1987         -1
25     25  55.0   $44k-$99k     0.0  Australia Aus         1980       TRUE
26     26   NaN   $55k-$66k     NaN       India,In         1934       TRUE
27     27  52.0   $44k-$99k     5.4       India,In         1935         -1
28     28   NaN   $39k-$88k     3.4  Australia Aus         1932         -1

In [ ]:
data_set.isna().sum()

Index          0
Age            7
Salary         0
Rating         1
Location       0
Established    0
Easy Apply     0
dtype: int64

In [ ]:
dataset = data_set.copy()
print(dataset)

    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       India,In         1999       TRUE
1       1  66.0   $55k-$66k     3.5    New York,Ny         2002       TRUE
2       2   NaN   $77k-$89k    -1.0    New York,Ny           -1         -1
3       3  64.0   $44k-$99k     4.4       India In         1988         -1
4       4  25.0   $44k-$99k     6.4  Australia Aus         2002         -1
5       5  44.0   $77k-$89k     1.4       India,In         1999       TRUE
6       6  21.0   $44k-$99k     0.0    New York,Ny           -1         -1
7       7  44.0   $44k-$99k    -1.0  Australia Aus           -1         -1
8       8  35.0   $44k-$99k     5.4    New York,Ny           -1         -1
9       9  22.0   $44k-$99k     7.7       India,In           -1       TRUE
10     10  55.0   $10k-$49k     5.4       India,In         2008       TRUE
11     11  44.0   $10k-$49k     6.7       India,In         2009         -1
12     12   NaN   $44k-$99k     0.0       India,In         1999         -1
13     13  25.0   $44k-$99k    -1.0  Australia Aus         2019       TRUE
14     14  66.0   $44k-$99k     4.0  Australia Aus         2020       TRUE
15     15  44.0  $88k-$101k     3.0  Australia Aus         1999         -1
16     16  19.0   $19k-$40k     4.5       India,In         1984         -1
17     17   NaN   $44k-$99k     5.3    New York,Ny         1943       TRUE
18     18  35.0   $44k-$99k     6.7    New York,Ny         1954       TRUE
19     19  32.0   $44k-$99k     3.3    New York,Ny         1955       TRUE
20     20   NaN   $44k-$99k     5.7    New York,Ny         1944       TRUE
21     21  35.0   $44k-$99k     5.0    New York,Ny         1946         -1
22     22  19.0   $55k-$66k     7.8    New York,Ny         1988       TRUE
23     23   NaN   $44k-$99k     2.4    New York,Ny         1999       TRUE
24     24  13.0   $44k-$99k    -1.0    New York,Ny         1987         -1
25     25  55.0   $44k-$99k     0.0  Australia Aus         1980       TRUE
26     26   NaN   $55k-$66k     NaN       India,In         1934       TRUE
27     27  52.0   $44k-$99k     5.4       India,In         1935         -1
28     28   NaN   $39k-$88k     3.4  Australia Aus         1932         -1

In [ ]:
dataset.isna().sum()

Index          0
Age            7
Salary         0
Rating         1
Location       0
Established    0
Easy Apply     0
dtype: int64

In [ ]:
dataset_age = data_set.Age.mean()
print(dataset_age)

39.04545454545455

In [ ]:
dataset['Age'] = dataset['Age'].fillna(dataset_age)
dataset['Age'] = dataset['Age'].round(decimals=1)
print(dataset)

    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       India,In         1999       TRUE
1       1  66.0   $55k-$66k     3.5    New York,Ny         2002       TRUE
2       2  39.0   $77k-$89k    -1.0    New York,Ny           -1         -1
3       3  64.0   $44k-$99k     4.4       India In         1988         -1
4       4  25.0   $44k-$99k     6.4  Australia Aus         2002         -1
5       5  44.0   $77k-$89k     1.4       India,In         1999       TRUE
6       6  21.0   $44k-$99k     0.0    New York,Ny           -1         -1
7       7  44.0   $44k-$99k    -1.0  Australia Aus           -1         -1
8       8  35.0   $44k-$99k     5.4    New York,Ny           -1         -1
9       9  22.0   $44k-$99k     7.7       India,In           -1       TRUE
10     10  55.0   $10k-$49k     5.4       India,In         2008       TRUE
11     11  44.0   $10k-$49k     6.7       India,In         2009         -1
12     12  39.0   $44k-$99k     0.0       India,In         1999         -1
13     13  25.0   $44k-$99k    -1.0  Australia Aus         2019       TRUE
14     14  66.0   $44k-$99k     4.0  Australia Aus         2020       TRUE
15     15  44.0  $88k-$101k     3.0  Australia Aus         1999         -1
16     16  19.0   $19k-$40k     4.5       India,In         1984         -1
17     17  39.0   $44k-$99k     5.3    New York,Ny         1943       TRUE
18     18  35.0   $44k-$99k     6.7    New York,Ny         1954       TRUE
19     19  32.0   $44k-$99k     3.3    New York,Ny         1955       TRUE
20     20  39.0   $44k-$99k     5.7    New York,Ny         1944       TRUE
21     21  35.0   $44k-$99k     5.0    New York,Ny         1946         -1
22     22  19.0   $55k-$66k     7.8    New York,Ny         1988       TRUE
23     23  39.0   $44k-$99k     2.4    New York,Ny         1999       TRUE
24     24  13.0   $44k-$99k    -1.0    New York,Ny         1987         -1
25     25  55.0   $44k-$99k     0.0  Australia Aus         1980       TRUE
26     26  39.0   $55k-$66k     NaN       India,In         1934       TRUE
27     27  52.0   $44k-$99k     5.4       India,In         1935         -1
28     28  39.0   $39k-$88k     3.4  Australia Aus         1932         -1

In [ ]:
dataset_rating = dataset.Rating.mean()
print(dataset_rating)

3.528571428571429

In [ ]:
dataset['Rating'] = dataset['Rating'].fillna(dataset_rating)
dataset['Rating'] = dataset['Rating'].round(decimals = 1)
print(dataset)

    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       India,In         1999       TRUE
1       1  66.0   $55k-$66k     3.5    New York,Ny         2002       TRUE
2       2  39.0   $77k-$89k    -1.0    New York,Ny           -1         -1
3       3  64.0   $44k-$99k     4.4       India In         1988         -1
4       4  25.0   $44k-$99k     6.4  Australia Aus         2002         -1
5       5  44.0   $77k-$89k     1.4       India,In         1999       TRUE
6       6  21.0   $44k-$99k     0.0    New York,Ny           -1         -1
7       7  44.0   $44k-$99k    -1.0  Australia Aus           -1         -1
8       8  35.0   $44k-$99k     5.4    New York,Ny           -1         -1
9       9  22.0   $44k-$99k     7.7       India,In           -1       TRUE
10     10  55.0   $10k-$49k     5.4       India,In         2008       TRUE
11     11  44.0   $10k-$49k     6.7       India,In         2009         -1
12     12  39.0   $44k-$99k     0.0       India,In         1999         -1
13     13  25.0   $44k-$99k    -1.0  Australia Aus         2019       TRUE
14     14  66.0   $44k-$99k     4.0  Australia Aus         2020       TRUE
15     15  44.0  $88k-$101k     3.0  Australia Aus         1999         -1
16     16  19.0   $19k-$40k     4.5       India,In         1984         -1
17     17  39.0   $44k-$99k     5.3    New York,Ny         1943       TRUE
18     18  35.0   $44k-$99k     6.7    New York,Ny         1954       TRUE
19     19  32.0   $44k-$99k     3.3    New York,Ny         1955       TRUE
20     20  39.0   $44k-$99k     5.7    New York,Ny         1944       TRUE
21     21  35.0   $44k-$99k     5.0    New York,Ny         1946         -1
22     22  19.0   $55k-$66k     7.8    New York,Ny         1988       TRUE
23     23  39.0   $44k-$99k     2.4    New York,Ny         1999       TRUE
24     24  13.0   $44k-$99k    -1.0    New York,Ny         1987         -1
25     25  55.0   $44k-$99k     0.0  Australia Aus         1980       TRUE
26     26  39.0   $55k-$66k     3.5       India,In         1934       TRUE
27     27  52.0   $44k-$99k     5.4       India,In         1935         -1
28     28  39.0   $39k-$88k     3.4  Australia Aus         1932         -1

In [ ]:
dataset['Easy Apply'] = dataset ['Easy Apply'].replace({'TRUE' :True , '-1':False})

In [ ]:
print(dataset['Easy Apply'])

0      True
1      True
2     False
3     False
4     False
5      True
6     False
7     False
8     False
9      True
10     True
11    False
12    False
13     True
14     True
15    False
16    False
17     True
18     True
19     True
20     True
21    False
22     True
23     True
24    False
25     True
26     True
27    False
28    False
Name: Easy Apply, dtype: bool

In [ ]:
print (dataset)

    Index   Age      Salary  Rating       Location  Established  Easy Apply
0       0  44.0   $44k-$99k     5.4       India,In         1999        True
1       1  66.0   $55k-$66k     3.5    New York,Ny         2002        True
2       2  39.0   $77k-$89k    -1.0    New York,Ny           -1       False
3       3  64.0   $44k-$99k     4.4       India In         1988       False
4       4  25.0   $44k-$99k     6.4  Australia Aus         2002       False
5       5  44.0   $77k-$89k     1.4       India,In         1999        True
6       6  21.0   $44k-$99k     0.0    New York,Ny           -1       False
7       7  44.0   $44k-$99k    -1.0  Australia Aus           -1       False
8       8  35.0   $44k-$99k     5.4    New York,Ny           -1       False
9       9  22.0   $44k-$99k     7.7       India,In           -1        True
10     10  55.0   $10k-$49k     5.4       India,In         2008        True
11     11  44.0   $10k-$49k     6.7       India,In         2009       False
12     12  39.0   $44k-$99k     0.0       India,In         1999       False
13     13  25.0   $44k-$99k    -1.0  Australia Aus         2019        True
14     14  66.0   $44k-$99k     4.0  Australia Aus         2020        True
15     15  44.0  $88k-$101k     3.0  Australia Aus         1999       False
16     16  19.0   $19k-$40k     4.5       India,In         1984       False
17     17  39.0   $44k-$99k     5.3    New York,Ny         1943        True
18     18  35.0   $44k-$99k     6.7    New York,Ny         1954        True
19     19  32.0   $44k-$99k     3.3    New York,Ny         1955        True
20     20  39.0   $44k-$99k     5.7    New York,Ny         1944        True
21     21  35.0   $44k-$99k     5.0    New York,Ny         1946       False
22     22  19.0   $55k-$66k     7.8    New York,Ny         1988        True
23     23  39.0   $44k-$99k     2.4    New York,Ny         1999        True
24     24  13.0   $44k-$99k    -1.0    New York,Ny         1987       False
25     25  55.0   $44k-$99k     0.0  Australia Aus         1980        True
26     26  39.0   $55k-$66k     3.5       India,In         1934        True
27     27  52.0   $44k-$99k     5.4       India,In         1935       False
28     28  39.0   $39k-$88k     3.4  Australia Aus         1932       False

In [ ]:
dataset.describe()

           Index        Age     Rating  Established
count  29.000000  29.000000  29.000000    29.000000
mean   14.000000  39.034483   3.527586  1638.620690
std     8.514693  13.973145   2.774230   762.079599
min     0.000000  13.000000  -1.000000    -1.000000
25%     7.000000  32.000000   1.400000  1935.000000
50%    14.000000  39.000000   4.000000  1984.000000
75%    21.000000  44.000000   5.400000  1999.000000
max    28.000000  66.000000   7.800000  2020.000000

In [ ]:
mode_Established = dataset ['Established'] . mode ()
print(mode_Established)

0      -1
1    1999
Name: Established, dtype: int64

In [ ]:
print(dataset.dtypes)
print(dataset['Established'].dtype)

Index            int64
Age            float64
Salary          object
Rating         float64
Location        object
Established      int64
Easy Apply        bool
dtype: object
int64

In [ ]:
dataset['Established'] = dataset ['Established'].replace({ -1:1999})

In [ ]:
print(dataset)

    Index   Age      Salary  Rating        Location  Established  Easy Apply
0       0  44.0   $44k-$99k     5.4       India,In,         1999        True
1       1  66.0   $55k-$66k     3.5    New York,Ny,         2002        True
2       2  39.0   $77k-$89k    -1.0    New York,Ny,         1999       False
3       3  64.0   $44k-$99k     4.4       India, In         1988       False
4       4  25.0   $44k-$99k     6.4  Australia, Aus         2002       False
5       5  44.0   $77k-$89k     1.4       India,In,         1999        True
6       6  21.0   $44k-$99k     0.0    New York,Ny,         1999       False
7       7  44.0   $44k-$99k    -1.0  Australia, Aus         1999       False
8       8  35.0   $44k-$99k     5.4    New York,Ny,         1999       False
9       9  22.0   $44k-$99k     7.7       India,In,         1999        True
10     10  55.0   $10k-$49k     5.4       India,In,         2008        True
11     11  44.0   $10k-$49k     6.7       India,In,         2009       False
12     12  39.0   $44k-$99k     0.0       India,In,         1999       False
13     13  25.0   $44k-$99k    -1.0  Australia, Aus         2019        True
14     14  66.0   $44k-$99k     4.0  Australia, Aus         2020        True
15     15  44.0  $88k-$101k     3.0  Australia, Aus         1999       False
16     16  19.0   $19k-$40k     4.5       India,In,         1984       False
17     17  39.0   $44k-$99k     5.3    New York,Ny,         1943        True
18     18  35.0   $44k-$99k     6.7    New York,Ny,         1954        True
19     19  32.0   $44k-$99k     3.3    New York,Ny,         1955        True
20     20  39.0   $44k-$99k     5.7    New York,Ny,         1944        True
21     21  35.0   $44k-$99k     5.0    New York,Ny,         1946       False
22     22  19.0   $55k-$66k     7.8    New York,Ny,         1988        True
23     23  39.0   $44k-$99k     2.4    New York,Ny,         1999        True
24     24  13.0   $44k-$99k    -1.0    New York,Ny,         1987       False
25     25  55.0   $44k-$99k     0.0  Australia, Aus         1980        True
26     26  39.0   $55k-$66k     3.5       India,In,         1934        True
27     27  52.0   $44k-$99k     5.4       India,In,         1935       False
28     28  39.0   $39k-$88k     3.4  Australia, Aus         1932       False

In [ ]:
dataset['Location'] = dataset['Location'].str.replace('India, In..', 'India, In.')

dataset['Location'] = dataset['Location'].str.replace('Australia, Aus..', 'Australia, Aus.')

dataset['Location'] = dataset['Location'].str.replace('New York, Ny', 'New York, Ny. ')
print (dataset)

    Index   Age      Salary  Rating         Location  Established  Easy Apply
0       0  44.0   $44k-$99k     5.4       India, In.         1999        True
1       1  66.0   $55k-$66k     3.5   New York, Ny.          2002        True
2       2  39.0   $77k-$89k    -1.0   New York, Ny.          1999       False
3       3  64.0   $44k-$99k     4.4       India, In.         1988       False
4       4  25.0   $44k-$99k     6.4  Australia, Aus.         2002       False
5       5  44.0   $77k-$89k     1.4       India, In.         1999        True
6       6  21.0   $44k-$99k     0.0   New York, Ny.          1999       False
7       7  44.0   $44k-$99k    -1.0  Australia, Aus.         1999       False
8       8  35.0   $44k-$99k     5.4   New York, Ny.          1999       False
9       9  22.0   $44k-$99k     7.7       India, In.         1999        True
10     10  55.0   $10k-$49k     5.4       India, In.         2008        True
11     11  44.0   $10k-$49k     6.7       India, In.         2009       False
12     12  39.0   $44k-$99k     0.0       India, In.         1999       False
13     13  25.0   $44k-$99k    -1.0  Australia, Aus.         2019        True
14     14  66.0   $44k-$99k     4.0  Australia, Aus.         2020        True
15     15  44.0  $88k-$101k     3.0  Australia, Aus.         1999       False
16     16  19.0   $19k-$40k     4.5       India, In.         1984       False
17     17  39.0   $44k-$99k     5.3   New York, Ny.          1943        True
18     18  35.0   $44k-$99k     6.7   New York, Ny.          1954        True
19     19  32.0   $44k-$99k     3.3   New York, Ny.          1955        True
20     20  39.0   $44k-$99k     5.7   New York, Ny.          1944        True
21     21  35.0   $44k-$99k     5.0   New York, Ny.          1946       False
22     22  19.0   $55k-$66k     7.8   New York, Ny.          1988        True
23     23  39.0   $44k-$99k     2.4   New York, Ny.          1999        True
24     24  13.0   $44k-$99k    -1.0   New York, Ny.          1987       False
25     25  55.0   $44k-$99k     0.0  Australia, Aus.         1980        True
26     26  39.0   $55k-$66k     3.5       India, In.         1934        True
27     27  52.0   $44k-$99k     5.4       India, In.         1935       False
28     28  39.0   $39k-$88k     3.4  Australia, Aus.         1932       False

<ipython-input-100-96ab8c05c85c>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  dataset['Location'] = dataset['Location'].str.replace('India, In..', 'India, In.')
<ipython-input-100-96ab8c05c85c>:3: FutureWarning: The default value of regex will change from True to False in a future version.
  dataset['Location'] = dataset['Location'].str.replace('Australia, Aus..', 'Australia, Aus.')

In [ ]:
print(dataset)

    Index   Age      Salary  Rating         Location  Established  Easy Apply
0       0  44.0   $44k-$99k     5.4       India, In.         1999        True
1       1  66.0   $55k-$66k     3.5   New York, Ny.          2002        True
2       2  39.0   $77k-$89k    -1.0   New York, Ny.          1999       False
3       3  64.0   $44k-$99k     4.4       India, In.         1988       False
4       4  25.0   $44k-$99k     6.4  Australia, Aus.         2002       False
5       5  44.0   $77k-$89k     1.4       India, In.         1999        True
6       6  21.0   $44k-$99k     0.0   New York, Ny.          1999       False
7       7  44.0   $44k-$99k    -1.0  Australia, Aus.         1999       False
8       8  35.0   $44k-$99k     5.4   New York, Ny.          1999       False
9       9  22.0   $44k-$99k     7.7       India, In.         1999        True
10     10  55.0   $10k-$49k     5.4       India, In.         2008        True
11     11  44.0   $10k-$49k     6.7       India, In.         2009       False
12     12  39.0   $44k-$99k     0.0       India, In.         1999       False
13     13  25.0   $44k-$99k    -1.0  Australia, Aus.         2019        True
14     14  66.0   $44k-$99k     4.0  Australia, Aus.         2020        True
15     15  44.0  $88k-$101k     3.0  Australia, Aus.         1999       False
16     16  19.0   $19k-$40k     4.5       India, In.         1984       False
17     17  39.0   $44k-$99k     5.3   New York, Ny.          1943        True
18     18  35.0   $44k-$99k     6.7   New York, Ny.          1954        True
19     19  32.0   $44k-$99k     3.3   New York, Ny.          1955        True
20     20  39.0   $44k-$99k     5.7   New York, Ny.          1944        True
21     21  35.0   $44k-$99k     5.0   New York, Ny.          1946       False
22     22  19.0   $55k-$66k     7.8   New York, Ny.          1988        True
23     23  39.0   $44k-$99k     2.4   New York, Ny.          1999        True
24     24  13.0   $44k-$99k    -1.0   New York, Ny.          1987       False
25     25  55.0   $44k-$99k     0.0  Australia, Aus.         1980        True
26     26  39.0   $55k-$66k     3.5       India, In.         1934        True
27     27  52.0   $44k-$99k     5.4       India, In.         1935       False
28     28  39.0   $39k-$88k     3.4  Australia, Aus.         1932       False